package com.gmail.gbmarkovsky;

/**
 * Хранит в себе набор контрольных точек и управляет их жизненным циклом.
 * 
 * @author george
 *
 */
public class CheckPointsManager {
	
	/**
	 * Набор для хранения контрольных точек по времени
	 */
	
	/**
	 * Набор для хранения контрольных точек по расстоянию
	 */
	
	/**
	 * Запрос на создание контрольной точки по времени
	 */
	
	/**
	 * Запрос на создание контрольной точки по расстоянию
	 */
	
	/*
	 * Надо будет ещё выбрать механизм с помощью которого
	 * менеджер будет оповещаться о изменении времени и пройденно дистанции
	 * 
	 */
}
